CSI API ETABS v1
cLoadCases.DirHistNonlinear Property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cCaseDirectHistoryNonlinear DirHistNonlinear { get; }
ReadOnly Property DirHistNonlinear As cCaseDirectHistoryNonlinear
	Get
Dim instance As cLoadCases
Dim value As cCaseDirectHistoryNonlinear
value = instance.DirHistNonlinear
property cCaseDirectHistoryNonlinear^ DirHistNonlinear {
	cCaseDirectHistoryNonlinear^ get ();
}
abstract DirHistNonlinear : cCaseDirectHistoryNonlinear with get
Property Value
Type: cCaseDirectHistoryNonlinear
See Also
Reference
cLoadCases Interface
ETABSv1 Namespace